#/usr/bin/python
#-*-coding:utf-8-*-

s = 0
a = input("请输入：")       # 2019-8-18
b = a.split('-')
print(b)
if int(b[0]) % 400 == 0 or (int(b[0]) % 4 ==0 and int(b[0]) % 100 != 0):
    day = [31, 29, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31]
    for i in range(int(b[1])- 1):
        s += day[i]
    s += int(b[2])
    a = ['星期一','星期二','星期三','星期四','星期五','星期六','星期日']
    c = s % 7
    print(f"{b[0]}年是闰年,是一年的第{s-1}天，今天是{a[c]}")
else:
    day = [31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31]
    for i in range(int(b[1])- 1):
        s += day[i]
    s += int(b[2])
    a = ['星期一', '星期二', '星期三', '星期四', '星期五', '星期六', '星期日']
    c = s % 7
    print(f"{b[0]}年不是闰年,是一年的第{s-1}天，今天是{a[c]}")
